{"rating": 5, "title": "Last of the Dogmen", "text": "A old movie, interesting modern cowboy dude with some Native american portions.  Drama - not a comedy.  I enjoyed it.  Purchased via stream - can download on any device and watch when and where you want.", "images": [], "parent_asin": "B09YMNWZK3", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1660711291279, "helpful_vote": 0, "verified_purchase": true, "category": "Movies_TV", "product_title": null}
{"rating": 5, "title": "A bugs life", "text": "An oldie, but a goodie in my opinion.  Fun actor voice  talent.  It's a great blast from the past.  Having said all of this, I never hesitate to update my reviews should new info seem useful. All of my reviews reflect my honest, personal experience with the reviewed item - your experience may be different. I am not influenced by any outside source. I receive/accept NO free products or discounts that are not available to all shoppers- ever. For some reason our shopper ranks are no longer visible - so, to give you a little more info about me, I am a top 50 reviewer (#30 the highest rank achieved). Those numbers used to fluctuate over time - up and down but I noticed that they stopped updating regularly - perhaps to phase them out.  I've been doing reviews for over 25 years with Amazon - nearly 6,000 reviews posted, viewed over 50,000 times, and over 24,000 likes.", "images": [], "parent_asin": "B084Z2FXBJ", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1669503006594, "helpful_vote": 1, "verified_purchase": true, "category": "Movies_TV", "product_title": null}
{"rating": 5, "title": "The princess bride", "text": "Ok.  Classic comedy here. Unbelievably awesome cast.  Classic lines you will never forget.  I would totally allow my 10 year old grandson watch it.  It's so so funny.  There are a few jokes that go over my 10 year old's head.. but that's ok.  It's still one of the best movies ever.  Even more better - I purchased online so all I have to do is download OR stream from my prime account - no DVD to store or carry.", "images": [], "parent_asin": "B00945XF8Q", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1621130490136, "helpful_vote": 0, "verified_purchase": true, "category": "Movies_TV", "product_title": null}
{"rating": 5, "title": "Somethings gotta give", "text": "A terrific classic - Diane Keaton is just amazing - off the discussion of the movie, but what she wears in this movie is so beautiful!  I want that style!  In any case, a terrific cast and a fun story - chock full of laughs.  Really for older teens/adults - strong sexual themes, language - just my opinion.", "images": [], "parent_asin": "B008Y6XUTU", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1660709781448, "helpful_vote": 0, "verified_purchase": true, "category": "Movies_TV", "product_title": null}
{"rating": 5, "title": "Murder on the Orient Express", "text": "A fabulous movie.. was inspired to purchase this one after recently purchasing the newly out Death on the Nile.  They are BOTH fabulous.  Well told, filmed and cast, they are both well worth a purchase.  I buy all my movies via stream any more... no DVD to store, play your purchased movie on any device and play when and where you chose.", "images": [], "parent_asin": "B08GSK9Y63", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1653779689684, "helpful_vote": 0, "verified_purchase": true, "category": "Movies_TV", "product_title": null}
{"rating": 5, "title": "Oregon made toffee peanuts", "text": "These are quite literally the best toffee peanuts I have ever had!  Not kidding!  Such an awesome holiday treat!  Dare you to buy some and not buy more!  Happy Holidays!   Having said all of this, I never hesitate to update my reviews should new info seem useful. All of my reviews reflect my honest, personal experience with the reviewed item - your experience may be different. I am not influenced by any outside source. I receive/accept NO free products or discounts that are not available to all shoppers- ever. For some reason our shopper ranks are no longer visible - so, to give you a little more info about me, I am a top 50 reviewer (#30 the highest rank achieved). Those numbers used to fluctuate over time - up and down but I noticed that they stopped updating regularly - perhaps to phase them out. It's a shame because it did help you see who has been around the longest and who is a trustworthy reviewer.  I've been doing reviews for over 25 years with Amazon - nearly 6,000 reviews posted, viewed over 50,000 times, and over 24,000 likes. I pay for all my stuff, just like you do.", "images": [], "parent_asin": "B08HZJC8DX", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1671734133727, "helpful_vote": 7, "verified_purchase": true, "category": "Grocery_Gourmet_Food", "product_title": "Oregon Farm Fresh Snacks Toffee Peanuts - Sun-Baked Sweet Peanuts Covered in Toffee - Locally Made Butter Toffee Peanut Snack - All Natural Ingredients - Resealable Bag Guarantees Freshness - (24oz)"}
{"rating": 5, "title": "Pantry item", "text": "I have a best friend who is a granny/nanny for her daughter's family who's husband is currently serving in our military.  They are a family of five and I just wanted to help with them with some pantry items.  This is one of her granddaughter's favs... yep... black beans!  Anyway, they are delicious, arrived quickly and in good condition.  I really appreciate that Amazon helps me to help them!", "images": [], "parent_asin": "B0B6JBY3ZP", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1413371958000, "helpful_vote": 4, "verified_purchase": true, "category": "Grocery_Gourmet_Food", "product_title": "Progresso Black Turtle Beans 15 oz Pull-Top Can (Pack of 24)"}
{"rating": 5, "title": "Happy belly hollandaise mix", "text": "You get 12 packages - which is probably WAY more than I'll ever use - but it's handy.  Each pack makes about a cup of hollandaise - which is a lot.  I like it.  I'll share most of the box with others and keep 2 or 3 pouches for myself - I don't use it that often.  I never hesitate to update my reviews should new info seem useful.", "images": [], "parent_asin": "B0BN5DGG4C", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1653778966454, "helpful_vote": 2, "verified_purchase": true, "category": "Grocery_Gourmet_Food", "product_title": "Amazon Brand - Happy Belly Hollandaise Sauce Mix, 0.9 Oz"}
{"rating": 5, "title": "Gold glitter star cake picks", "text": "These stand about 5 or 6\"... they are gold and glittery.  However, the glitter didn't sprinkle around.  I used them for names on a multi-birthday celebration.  Perfect.", "images": [], "parent_asin": "B01H81XVNQ", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1630365445349, "helpful_vote": 0, "verified_purchase": true, "category": "Grocery_Gourmet_Food", "product_title": "TooMeeCrafts Double Sided Gold Glitter Star Cake Topper for Twinkle Twinkle Little Star Baby Shower Theme Decoration Pack of 12"}
{"rating": 5, "title": "duncan hines cake kit", "text": "I call this duncan hines cake kit, lazy cake.  It's just the right size and you have what you need to make it - short of adding the egg.  My personal all time cake favorite is yellow or white cake with chocolate frosting so this fits the bill.  Do I use this kit and eat regularly? No its purely a treat once in a very long time - but easy when I want a treat.", "images": [], "parent_asin": "B09SZCMVSN", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1657986534266, "helpful_vote": 4, "verified_purchase": true, "category": "Grocery_Gourmet_Food", "product_title": "Duncan Hines Easy Cake Kit Chocolate Lover's Cake Mix, 8.4 oz"}
{"rating": 5, "title": "beats fit pro true wireless head phones", "text": "husband says - they fit and stay in your ear - microphone works well.  I never hesitate to update my reviews should new info seem useful.", "images": [], "parent_asin": "B0C33824RM", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1653778081398, "helpful_vote": 0, "verified_purchase": true, "category": "Electronics", "product_title": "Beats Fit Pro with $25 Amazon Gift Card - Beats White"}
{"rating": 5, "title": "Extra heavy duty zip ties", "text": "Husband needed these to attach a netting to a tree.  Worked perfectly.  Zip ties are useful for a lot of things and sometimes you need a REALLY big one.  These are it.", "images": [], "parent_asin": "B00ZPRNQSQ", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1484522602000, "helpful_vote": 0, "verified_purchase": true, "category": "Electronics", "product_title": "Serious Ties - Extra Heavy Duty Cable Ties (10, 24 Inch/175Lbs/UV Black)"}
{"rating": 5, "title": "Memory Foam galaxy bud pro tips", "text": "I purchased these to replace the tips that came with galaxy pro ear buds.  I purchased a different brand and they were too wide and not tall enough.  These are slightly taller - but less wide.  They work better for me.  It is a bit tricky to install them first.  Don't give up - pressing firmly.  Then, you should know that one size may work for one ear and another size the other.  I do have a bit of a problem keeping this in - but it's not the foam tip fault.  They keep them fairly short so they fit in the mini charger box.  I really need a longer foam tip to keep them in my ear.  I'm back to using my corded ear phones most of the time - it's a real shame because these would be so convenient in size.  Of all the foam tips, these were the best - they are not quite long enough to help me.  I never hesitate to update my reviews should new info seem useful.", "images": [], "parent_asin": "B09B48ZGJV", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1641939552713, "helpful_vote": 5, "verified_purchase": true, "category": "Electronics", "product_title": "Memory Foams Pro Active V2.0 Patented Silicone Memory Foam Ear Tips for Galaxy Buds Pro and Jabra 85t. Stays in, Last 5X Longer, No Sweat/Wax. Replacement for Samsung Galaxy Buds Pro Tips. CharJenPro"}
{"rating": 5, "title": "short micro USB cables", "text": "These are really short... about 12&#34; as advertised... heavy duty.  Work when you have a super short distance to and don't want to &#34;tie&#34; up extra cord. I use in my car because I have a stand for the phone that is very close to the power point. Works great.  There are 5 in the pack... all different colors.  They have worked so far - but I never hesitate to update my reviews should new info seem useful.", "images": [], "parent_asin": "B01DJ96XDQ", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1535940651531, "helpful_vote": 46, "verified_purchase": true, "category": "Electronics", "product_title": "Short Micro USB Cables 1Ft [5 Pack] Nylon Braided, HONEST KIN Fast Charging USB 2.0 Android Charger Cord Compatible with Power Banks, Phones Samsung Galaxy S7/ HTC/LG, Kindle,PS4,Camera,MP3,TV Stick"}
{"rating": 5, "title": "Beltronics", "text": "I have owned many radar detectors.. they don't last forever, so I needed a replacement. It took a while for me to figure out how to turn down the volume (you need to push and HOLD the volume button when it is NOT alarming until it drops - but if you hold it down too long it goes up again. This is NOT explained in the instruction booklet)... but once I figured that out, it 's more pleasant. In my car, in order to give it a full view front and back, it has to be placed near the review view mirror.. (I have an SUV) I also purchased a very sturdy suction cup holder (with an anchor hammer) to replace the less sturdy &#34;press and hope they hold&#34; suction cups provided. I have received alarms... with police cars in plain view.. I did take the advice of another reviewer to drop the &#34;x&#34; hits. It's fairly quiet and seems accurate. I am running on &#34;autoscan&#34; rather than city or highway.  I will continue to post updates if new info would be useful.  My review is a reflection of my own personal experience and may differ from yours... and I respect that.  I hope we can all be honest and respectful.<br />UPDATE:  7/11/2017....  So I have been using this detector for several weeks...  I am more and more impressed by it.  It's picked up signals around bends and such.  Once I figured out how to quiet the initial blasts, it's much more pleasing.  All in all I am going to bump up my review to 5 stars from 4.  I never hesitate to update my review should new info seem useful.", "images": [], "parent_asin": "B007P2NKNU", "user_id": "AFZUK3MTBIBEDQOPAK3OATUOUKLA", "timestamp": 1497223995000, "helpful_vote": 23, "verified_purchase": true, "category": "Electronics", "product_title": "Beltronics RX65-BLUE Professional Series Radar Detector"}
