{"rating":5,"title":"Abbott and Costello universal collection","text":"This was probably my favorite prime day purchase and was a fantastic deal.  My daughter (39 years) is so excited to watch these and share with my grandsons these movies of her childhood.  They were old then, old when I watched me as a child too!  But funny is funny.  It's an era of comedy that has passed and is being rediscovered and appreciated again.  We gave up buying DVD's a long time ago and just stream purchases any more - but this set was worthy of the purchase.  Whole Family friendly and worth the price when not on sale!","parent_asin":"B00IJUIY3S","helpful_vote":0,"verified_purchase":0,"category":"Movies_TV","product_title":"Abbott & Costello: Universal Pictures Collection"}
{"rating":5,"title":"The intern","text":"Rather an oldie - but a cute, satisfying story and Robert DeNero.  I liked it, my husband loved it.  We purchased this via stream service (wifi) - no DVD to store, download your purchase to about any device and play when and where you want.","parent_asin":"B015SKC7KW","helpful_vote":0,"verified_purchase":1,"category":"Movies_TV","product_title":"The Intern"}
{"rating":5,"title":"Funny Farm","text":"Great Chevy Chase classic.  I have a postman that actually acts like the one in this movie so it's hilarious to me.  Worthy of watch.  The oldies are the best","parent_asin":"B00901SNW2","helpful_vote":0,"verified_purchase":1,"category":"Movies_TV","product_title":"Funny Farm"}
{"rating":5,"title":"Monsters inc","text":"Oh please.  Who doesn't love Boo and kitty and Mike Wazowski??  You'll recognize the voices and the story is very sweet and of course, with Disney - there is a life lesson.  Great colors and animation - a really fun movie that my 8 year old grandson loved when he was really little and still does.  We purchase all our movies via stream any more.  No DVD to store and access on about any device and any time for download or stream.  So, we are collecting some of the old favs - including this one!","parent_asin":"B00BHU9CCO","helpful_vote":0,"verified_purchase":1,"category":"Movies_TV","product_title":"Monsters, Inc."}
{"rating":5,"title":"Die Hard","text":"My husband considers this a christmas movie.  Eh... not me so much.  But it is action packed and a great young bruce willis project.  Foreign terrorists take over a building.  Wife is very successful - marriage on the rock with bruce willis - he wants to reconcile.. she is less convinced - until he shows his hero badge.  It's a fun action packed movie.  No nudity or sex, but lots of language - in case you're considering ages.  We purchase all our movies via stream any more - no DVD to store or break and you can download to most any device.  Win\/win","parent_asin":"B009EEQO08","helpful_vote":0,"verified_purchase":1,"category":"Movies_TV","product_title":"Die Hard"}
{"rating":5,"title":"Bobs Red Mill Organic brown rice farina","text":"Bobs red mill organic brown rice farina.  One of my favorite cereals.  I prefer Bobs Red Mill brand the best. In my opinion is tastes better than cream of wheat - creamier in texture and of course tastes different than wheat because it's rice.  Easy on an upset stomach.  And delicious when you want a creamier cereal than wheat or oats. I like it sweet or savory - a little butter and cinnamon and sugar or a poached egg on top with a little salt and pepper. Having said all of this, I never hesitate to update my reviews should new info seem useful. All of my reviews reflect my honest, personal experience with the reviewed item - your experience may be different. I am not influenced by any outside source. I receive\/accept NO free products or discounts that are not available to all shoppers- ever. For some reason our shopper ranks are no longer visible - so, to give you a little more info about me, I am a top 50 reviewer (#30 the highest rank achieved). Those numbers used to fluctuate over time - up and down but I noticed that they stopped updating regularly - perhaps to phase them out. It's a shame because it did help you see who has been around the longest and who is a trustworthy reviewer.혻 I've been doing reviews for over 25 years with Amazon - over 6,000 reviews posted, those reviews have been viewed well over 50,000 times, including well over 25,000 likes. Bottom line, I pay for all my stuff, just like you do.","parent_asin":"B084J66X7Z","helpful_vote":2,"verified_purchase":1,"category":"Grocery_Gourmet_Food","product_title":"Bob's Red Mill Organic Brown Rice Farina Creamy Rice Hot Cereal, 24 Oz"}
{"rating":5,"title":"full size Big Bunk Bars","text":"Ooo. I LOVE Big hunk bars.  They are deeply chewy (NOT for questionable mouth gear) and little - how would say, not really salt, but peanutty - just a little with the peanuts.  Mostly it's about that chewy nougat.  MMMMMmmm  I've always loved them.  Freeze and break into pieces, or break at room temp.  For whatever reason I can't get them locally, so I have to order.  Really happy with these - you get 6 full size bars.  A big spendy, but worth it to me.  They are  혻Having said all of this, I never hesitate to update my reviews should new info seem useful. All of my reviews reflect my honest, personal experience with the reviewed item - your experience may be different. I am not influenced by any outside source. I receive\/accept NO free products or discounts that are not available to all shoppers- ever. For some reason our shopper ranks are no longer visible - so, to give you a little more info about me, I am a top 50 reviewer (#30 the highest rank achieved). Those numbers used to fluctuate over time - up and down but I noticed that they stopped updating regularly - perhaps to phase them out. It's a shame because it did help you see who has been around the longest and who is a trustworthy reviewer.혻 I've been doing reviews for over 25 years with Amazon - over 6,000 reviews posted, those reviews have been viewed well over 50,000 times, including well over 25,000 likes. Bottom line, I pay for all my stuff, just like you do.","parent_asin":"B0BFBXGBCN","helpful_vote":0,"verified_purchase":1,"category":"Grocery_Gourmet_Food","product_title":"Annabelle's Big Hunk Candy Bars, 1.8oz Bar (6 Pack) - Full-Size Old Fashioned Nougat Peanut Candies - By Dr. Plenty"}
{"rating":5,"title":"Haas Avocados","text":"Honestly, I think that Haas avocados are the very best - taste and creamy texture.  The best flesh in my opinion.  Best when on sale, of course!","parent_asin":"B07C5ZMJ5H","helpful_vote":0,"verified_purchase":1,"category":"Grocery_Gourmet_Food","product_title":"Avocado Hass Large Conventional, 1 Each"}
{"rating":5,"title":"conventally grown limes","text":"The limes were great... fresh, firm and delicious.  I don't purchase organic citrus - because you generally don't eat the skins and they are thick enough.  I save organic purchases for things like apples, berries, potatoes, and other items you eat the skins of - just my personal opinion!","parent_asin":"B07811WM8Z","helpful_vote":1,"verified_purchase":1,"category":"Grocery_Gourmet_Food","product_title":"Lime Regular Conventional, 1 Each"}
{"rating":5,"title":"Flaky finishing sea salt","text":"This is a beautiful, flaky finishing sea salt.  Comes in a plastic jar with screw on lid.  (Do wish it was glass and may re-jar it).  The flakes are fairly large - meant to be a finishing salt, but could be cooked.  Having said all of this, I never hesitate to update my reviews should new info seem useful. All of my reviews reflect my honest, personal experience with the reviewed item - your experience may be different. I am not influenced by any outside source. I receive\/accept NO free products or discounts that are not available to all shoppers- ever. For some reason our shopper ranks are no longer visible - so, to give you a little more info about me, I am a top 50 reviewer (#30 the highest rank achieved). Those numbers used to fluctuate over time - up and down but I noticed that they stopped updating regularly - perhaps to phase them out. It's a shame because it did help you see who has been around the longest and who is a trustworthy reviewer.혻 I've been doing reviews for over 25 years with Amazon - over 6,000 reviews posted, those reviews have been viewed well over 50,000 times, including well over 25,000 likes. Bottom line, I pay for all my stuff, just like you do.","parent_asin":"B06XKSFW4P","helpful_vote":4,"verified_purchase":1,"category":"Grocery_Gourmet_Food","product_title":"Saltverk Flaky Sea Salt, 3.17 Ounces of Handcrafted Gourmet Salt Flakes from Iceland"}
{"rating":5,"title":"camera mounting kit","text":"Camera mounting kit.  Husband reports it works perfectly for his application.  It is white and plastic.  Easy to install.  Having said all of this, I never hesitate to update my reviews should new info seem useful. All of my reviews reflect my honest, personal experience with the reviewed item - your experience may be different. I am not influenced by any outside source. I receive\/accept NO free products or discounts that are not available to all shoppers- ever. For some reason our shopper ranks are no longer visible - so, to give you a little more info about me, I am a top 50 reviewer (#30 the highest rank achieved). Those numbers used to fluctuate over time - up and down but I noticed that they stopped updating regularly - perhaps to phase them out. It's a shame because it did help you see who has been around the longest and who is a trustworthy reviewer.혻 I've been doing reviews for over 25 years with Amazon - over 6,000 reviews posted, those reviews have been viewed well over 50,000 times, including well over 25,000 likes. Bottom line, I pay for all my stuff, just like you do.","parent_asin":"B06X9ZNT4P","helpful_vote":0,"verified_purchase":1,"category":"Electronics","product_title":"Axis Communications T91L61 Camera Mounting Kit White (5801-721)"}
{"rating":5,"title":"micro memory card for samsung phones","text":"This memory card is a must have if you have a Samsung galaxy that takes a memory card, like an S10+.  If you have a new S22 ultra, they do not take a memory card.  So you'll want to make sure your card takes an additional backup memory card AND the right size.  This one is a 'micro' size.  Having said all of this, I never hesitate to update my reviews should new info seem useful. All of my reviews reflect my honest, personal experience with the reviewed item - your experience may be different. I am not influenced by any outside source. I receive\/accept NO free products or discounts that are not available to all shoppers- ever. For some reason our shopper ranks are no longer visible - so, to give you a little more info about me, I am a top 50 reviewer (#30 the highest rank achieved). Those numbers used to fluctuate over time - up and down but I noticed that they stopped updating regularly - perhaps to phase them out. It's a shame because it did help you see who has been around the longest and who is a trustworthy reviewer.혻 I've been doing reviews for over 25 years with Amazon - over 6,000 reviews posted, those reviews have been viewed well over 50,000 times, including well over 24,000 likes. Bottom line, I pay for all my stuff, just like you do.","parent_asin":"B08KSG2JMV","helpful_vote":2,"verified_purchase":1,"category":"Electronics","product_title":"SanDisk 256GB Micro Extreme Memory Card for Samsung Phone Works with Galaxy S20, S20+, S20 Ultra, S20 FE 5G (SDSQXAV-256G-GN6MN) Bundle with (1) Everything But Stromboli 3.0 SDXC & MicroSD Card Reader"}
{"rating":5,"title":"ear bud covers","text":"Don't work with the Samsung earbud pros... so they are junk to me... gotta pay better attention to the details when purchasing (hubby - GRRR).  They are a nice selection of moldable foam tips if you have something they will fit on.","parent_asin":"B07B1L21NK","helpful_vote":1,"verified_purchase":1,"category":"Electronics","product_title":"JLab Cloud Foam Mnemonic Earbud Tips | 4 Pairs of Custom Fit Universal Tips | Memory Cloud Foam | Black\/Blue"}
{"rating":5,"title":"husband says excellent","text":"Husband purchased these as a gift for a teacher who is sharing his skills at bird watching with young kids.  Husband reports they work wonderfully and were greatly appreciated.","parent_asin":"B0001HKIK4","helpful_vote":1,"verified_purchase":1,"category":"Electronics","product_title":"Nikon 7245 Action 10x50 EX Extreme All-Terrain Binocular"}
{"rating":5,"title":"So far, so good","text":"I've had this computer for a few weeks now.  It's been great.  Fast and easy.  The BEST part?? Windows 7.  Yup.  I HATE 8.  Won't have it. I am a mouse user, hate the touch pad.  One the greatest things about this computer is that you can EASILY turn the touch pad on and off with a double tap in the right spot. Perfect.  Honestly, I'm very happy with this notebook that DOES NOT have windows 8.  :)","parent_asin":"B009PHTHRG","helpful_vote":5,"verified_purchase":1,"category":"Electronics","product_title":"HP 4540s i5-3210M 16-Inch Notebook (500 GB, 4 GB SO-DIMM DDR3 Windows 7, Intel HD Graphics 4000)"}